any where (event.category : "file" and (process.executable : ("*WINWORD.EXE", "*EXCEL.EXE", "*POWERPNT.EXE", "*MSPUB.EXE", "*VISIO.EXE", "*OUTLOOK.EXE") and file.path : ("*.library-ms", "*.msc", "*.rtf", "*.mdb", "*.accdb", "*.accde", "*.mmp", "*.rdp", "*.chm", "*.dot", "*.jse", "*.bat", "*.sct", "*.url", "*.cmd", "*.hta", "*.htm", "*.ps1", "*.js", "*.vbs", "*.dll", "*.exe", "*.one", "*.onepkg", "*.bz2", "*.gzip", "*.au3")) and not (file.path : "*\\AC\\Temp\\*" and file.path : "*\\Local\\Packages\\*" or file.path : "*SmartLookupCache*" and file.path : "*microsoft.office.smartlookup.ssr.js*" or file.path : "*INetCache*" and file.path : "*].js*" or file.path : "*Content*" and file.path : "*IE*" and file.path : "*].js*" or file.path : ("*\\~$*", "*\\Setup[1].exe*", "*NewOutlookInstall*", "*\\Temp\\OICE_*", "*INetCache\\Content.MSO*", "*\\Javascript\\*", "*\\assembly\\tmp\\*", "*Temp\\hpcUK*", "*\\EPSON*")))
